## 탐색적 자료분석

In [1]:
import pandas as pd
import seaborn as sns

ti = sns.load_dataset('titanic')
ti

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [2]:
ti.groupby('sex').mean()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

In [6]:
sps = ti.groupby(['sex','pclass'])['survived'].mean().to_frame()

In [7]:
sps.index

MultiIndex([('female', 1),
            ('female', 2),
            ('female', 3),
            (  'male', 1),
            (  'male', 2),
            (  'male', 3)],
           names=['sex', 'pclass'])

In [8]:
# 여성 2등석 생존율 추출
sps.loc[('female', 2), :]

survived    0.921053
Name: (female, 2), dtype: float64

In [9]:
sps2 = sps.reset_index()
sps2

      sex  pclass  survived
0  female       1  0.968085
1  female       2  0.921053
2  female       3  0.500000
3    male       1  0.368852
4    male       2  0.157407
5    male       3  0.135447

In [11]:
sps2.index

RangeIndex(start=0, stop=6, step=1)

In [12]:
sps2.loc[1,:]

sex           female
pclass             2
survived    0.921053
Name: 1, dtype: object

## 뭐하는

In [14]:
df1 = pd.DataFrame({
    '고객명': ['박세리', '이대호', '손흥민', '김연아', '마이클조던'],
    '생년월일': ['1980-01-02', '1982-02-22', '1993-06-12', '1988-10-16', '1970-03-03'],
    '성별': ['여자', '남자', '남자', '여자', '남자']})

df2 = pd.DataFrame({
    '고객명': ['김연아', '박세리', '손흥민', '이대호', '타이거우즈'],
    '연봉': ['2000원', '3000원', '1500원', '2500원', '3500원']})

# 탐색적?

In [16]:
ti['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [18]:
# 항구별 생존자 수

ti.groupby('embarked')['survived'].sum()

embarked
C     93
Q     30
S    217
Name: survived, dtype: int64

In [19]:
ti.groupby('embarked')['survived'].agg(['count','sum','mean'])

          count  sum      mean
embarked
C           168   93  0.553571
Q            77   30  0.389610
S           644  217  0.336957

In [20]:
ti.groupby('sex')['survived'].agg(['count','sum','mean'])

        count  sum      mean
sex
female    314  233  0.742038
male      577  109  0.188908

In [24]:
res = ti.groupby(['who','pclass'])['survived'].agg(['sum','mean'])
res = res.reset_index()
res.sort_values(by = 'mean', ascending=False).reset_index(drop=True)

     who  pclass  sum      mean
0  child       2   19  1.000000
1  woman       1   89  0.978022
2  woman       2   60  0.909091
3  child       1    5  0.833333
4  woman       3   56  0.491228
5  child       3   25  0.431034
6    man       1   42  0.352941
7    man       3   38  0.119122
8    man       2    8  0.080808

In [26]:
pd.DataFrame(ti.groupby(['pclass','who'])['fare'].mean())

                    fare
pclass who
1      child  139.382633
       man     65.951086
       woman  104.317995
2      child   28.323905
       man     19.054124
       woman   20.868624
3      child   23.220190
       man     11.340213
       woman   15.354351

In [28]:
rich = ti['fare'].quantile(0.9)
rich

77.9583

In [30]:
ti.loc[ti['fare']>=rich, 'survived'].agg(['count','mean'])

count    90.000000
mean      0.766667
Name: survived, dtype: float64

In [31]:
male_mean = ti.groupby('sex')['age'].mean()['male']
female_mean = ti.groupby('sex')['age'].mean()['female']

ti.loc[ti['sex']=='male','age'] = ti.loc[ti['sex']=='male','age'].fillna(male_mean)
ti.loc[ti['sex']=='female','age'] = ti.loc[ti['sex']=='male','age'].fillna(female_mean)